### Introduction

In this lesson, we'll see how to use common table expressions (CTEs) in SQL.  CTEs allow us to create a temporary query which we can then reference for later queries.  Let's see it!

### Loading our Data

To learn about CTEs we'll use our movie films database.  Let's get started by connecting to the database with sqlite.

In [3]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('movie_films_actors.db')
cursor = conn.cursor()

In [4]:
df = pd.read_csv('movies.csv', index_col = 0)

In [5]:
df.to_sql('movies', conn, if_exists = 'replace', index_label = 'id')

15111

And then, let's take a look at some of the data in our `movies` table:

In [6]:
import pandas as pd
df = pd.read_sql('SELECT * FROM movies;', conn)

In [7]:
df[:2]

,id,title,studio,runtime,description,release_date,year
0,0,!Women Art Revolution,Zeitgeist Films,83.0,"Through intimate interviews, art, and rarely s...",2011-06-01 00:00:00,2011
1,1,#Horror,Lowland Pictures,90.0,You've got followers... Cyberbullying goes off...,2015-11-20 00:00:00,2015

So we can see that we have different information about each movie like the title, runtime, and year of release, among other columns.

### A two step problem

Now let's say that we want to use SQL to find the following: 
  * **years where movies have an average length greater than 120.**  
    
One way to do this would be to simply using the `HAVING` clause.

In [36]:
query = '''SELECT AVG(runtime) as avg_runtime, year FROM movies
GROUP BY year HAVING avg_runtime > 120;'''
pd.read_sql(query, conn)

   avg_runtime  year
0        181.0  1914
1        133.5  1915
2        175.0  1916

And we can see that all of these movies are from the 1910s.  Ok so using HAVING is one way to complete the above task.  Another way is with a common table expression.  

With a common table expression, we can create a temporary table. Below, we use this to first group ourÂ movies by year and create a temporary table that has a column of average runtimes per year.  Then, in a separate step we'll select those years that meet our threshold.

In [6]:
query = """WITH movie_years AS (
SELECT
        AVG(runtime) as avg_runtime,
        year
FROM movies GROUP BY year
)

SELECT     avg_runtime,
        year
FROM movie_years WHERE avg_runtime > 120;"""

In [7]:
pd.read_sql(query, conn)

   avg_runtime  year
0        181.0  1914
1        133.5  1915
2        175.0  1916

Ok, let's break this down.  

1. The `WITH movie_years` creates a new temporary table called `movies_years`.  It's populated with the results of the SELECT statement.

2. Then in the second SELECT statement we select from our newly created table `movie_years`.  So notice that we do not need to use the HAVING clause in the second SELECT statement, because we `avg_runtime` exists as a **column** in our temporary table.

> Here's that CTE again.

```sql
WITH movie_years AS (
  SELECT AVG(runtime) as avg_runtime, year
  FROM movies GROUP BY year
)

SELECT avg_runtime, year FROM movie_years WHERE avg_runtime > 120;
```

So we can see that in CTEs, we create a temporary table with the following syntax:

```SQL
WITH table_name AS (
   SELECT ...
)

SELECT ... FROM table_name;
```

### CTEs and MultiLevel Aggregations

So above we saw how we can use CTEs to create a temporary table, and we can then query from that temporary table.  But so far, we could have simply used the HAVING clause instead of our CTE.  

Another usecase, where a CTE is more necessary, is with multilevel aggregations.  For example, let's say that we want to find for each year, the studio with the highest average runtime.  

> So maybe would find that Warner Bros has the highest average runtime for 1950, and Disney for 1951. 

To perform this query, we can start with just a SELECT statement that groups our movies by `year` and `studio`, and returns the average runtime per studio per year.

In [7]:
sql = """
  SELECT AVG(runtime) as avg_runtime_per_studio_year, studio, year
  FROM movies GROUP BY year, studio ORDER BY year LIMIT 8;
"""

cursor.execute(sql)
cursor.fetchall()

[(181.0, 'Itala Film', 1914),
 (75.0, 'Box Office Attractions', 1915),
 (192.0, 'Gravitas', 1915),
 (175.0, 'Cohen Media Group', 1916),
 (102.0, 'Kino on Video', 1919),
 (107.0, 'Kino Lorber', 1920),
 (52.0, 'Rialto Pictures', 1920),
 (None, 'Samuel Goldwyn Company', 1920)]

The above gives the average runtime of each studio per year.  But remember we want to find the studio with the highest average runtime for each year.  

To do this, we can use a CTE to build off of our query above.

In [12]:
sql = """WITH movie_studio_years AS (
  SELECT AVG(runtime) as avg_runtime_per_studio_year, studio, year
  FROM movies GROUP BY year, studio
), avg_runtimes_rank AS (
    SELECT avg_runtime_per_studio_year, 
    studio,
    year,
    rank() OVER (partition by year ORDER BY avg_runtime_per_studio_year) as runtime_rank
    FROM movie_studio_years
)

SELECT * FROM avg_runtimes_rank WHERE runtime_rank = 1 LIMIT 5
"""

cursor.execute(sql)
cursor.fetchall()

# [(181.0, 'Itala Film', 1914),
#  (192.0, 'Gravitas', 1915),
#  (175.0, 'Cohen Media Group', 1916),
#  (102.0, 'Kino on Video', 1919),
#  (107.0, 'Kino Lorber', 1920)]

[(181.0, 'Itala Film', 1914, 1),
 (75.0, 'Box Office Attractions', 1915, 1),
 (175.0, 'Cohen Media Group', 1916, 1),
 (102.0, 'Kino on Video', 1919, 1),
 (None, 'Samuel Goldwyn Company', 1920, 1)]

So above, we create a new temporary table `movie_studio_years` that calculates the average runtime per studio per year -- just like before.  And then from that initial table, used a window function to rank the studios by their runtime per year.  

Finally, we selected just those studios with a top rank per year.

> Notice that with the second CTE, we no longer needed a `WITH` clause.  Instead, we just had a comma, and then the name of the next CTE:

> `, avg_runtimes_rank AS (`

### Summary

In this lesson we learned about CTEs.  The CTE allows us to create a temporary table and then query from that table.  We write our CTE with the following syntax:

```SQL
WITH table_name AS (
   SELECT ...
)

SELECT ... FROM table_name;
```

In general, we use CTEs to break our code up in to multiple steps.  For example, we saw how we can use CTEs to perform a multilevel aggregation, where we first calculated the average movie runtime per studio and year, and then from there found the studio with the highest average runtime per year.

```sql
WITH movie_studio_years AS (
  SELECT AVG(runtime) as avg_runtime_per_studio_year, studio, year
  FROM movies GROUP BY year, studio
), avg_runtimes_rank AS (
    SELECT avg_runtime_per_studio_year, 
    studio,
    year,
    rank() OVER (partition by year ORDER BY avg_runtime_per_studio_year) as runtime_rank
    FROM movie_studio_years
)

SELECT * FROM avg_runtimes_rank WHERE runtime_rank = 1 LIMIT 5
```